Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateRevealIntegral Property
 Could not create integral reveal for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateRevealIntegral { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateRevealIntegral As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateRevealIntegral {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace